# SQL: JoinQueries

## Setup

We are now installing the necessary packages to interact with the MySQL database and issue SQL queries using the notebook.

In [1]:
!sudo apt-get install python3-mysqldb
!sudo pip3 install -U sqlalchemy sql_magic

Reading package lists... Done
Building dependency tree
Reading state information... Done
python3-mysqldb is already the newest version (1.3.10-1build1).
0 upgraded, 0 newly installed, 0 to remove and 5 not upgraded.
WARNING: The directory '/home/ubuntu/.cache/pip' or its parent directory is not owned or is not writable by the current user. The cache has been disabled. Check the permissions and owner of that directory. If executing pip with sudo, you may want sudo's -H flag.
Collecting sqlalchemy
  Downloading SQLAlchemy-1.3.16-cp36-cp36m-manylinux2010_x86_64.whl (1.2 MB)
     |████████████████████████████████| 1.2 MB 11.5 MB/s eta 0:00:01
Requirement already up-to-date: sql_magic in /usr/local/lib/python3.6/dist-packages (0.0.4)
Requirement already satisfied, skipping upgrade: jupyter in /usr/local/lib/python3.6/dist-packages (from sql_magic) (1.0.0)
Requirement already satisfied, skipping upgrade: pandas in /usr/local/lib/python3.6/dist-packages (from sql_magic) (1.0.1)
Requirement already satisfied, skipping upgrade: traitlets in /usr/local/lib/python3.6/dist-packages (from sql_magic) (4.3.3)
Requirement already satisfied, skipping upgrade: findspark in /usr/local/lib/python3.6/dist-packages (from sql_magic) (1.3.0)
Requirement already satisfied, skipping upgrade: ipython in /usr/local/lib/python3.6/dist-packages (from sql_magic) (7.12.0)
Requirement already satisfied, skipping upgrade: sqlparse in /usr/local/lib/python3.6/dist-packages (from sql_magic) (0.3.0)
Requirement already satisfied, skipping upgrade: nbconvert in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (5.6.1)
Requirement already satisfied, skipping upgrade: qtconsole in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (4.6.0)
Requirement already satisfied, skipping upgrade: jupyter-console in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (6.1.0)
Requirement already satisfied, skipping upgrade: ipykernel in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (5.1.4)
Requirement already satisfied, skipping upgrade: ipywidgets in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (7.5.1)
Requirement already satisfied, skipping upgrade: notebook in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (6.0.3)
Requirement already satisfied, skipping upgrade: numpy>=1.13.3 in /usr/local/lib/python3.6/dist-packages (from pandas->sql_magic) (1.18.1)
Requirement already satisfied, skipping upgrade: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas->sql_magic) (2.8.1)
Requirement already satisfied, skipping upgrade: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas->sql_magic) (2019.3)
Requirement already satisfied, skipping upgrade: ipython-genutils in /usr/local/lib/python3.6/dist-packages (from traitlets->sql_magic) (0.2.0)
Requirement already satisfied, skipping upgrade: six in /usr/local/lib/python3.6/dist-packages (from traitlets->sql_magic) (1.14.0)
Requirement already satisfied, skipping upgrade: decorator in /usr/local/lib/python3.6/dist-packages (from traitlets->sql_magic) (4.4.1)
Requirement already satisfied, skipping upgrade: pygments in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (2.5.2)
Requirement already satisfied, skipping upgrade: jedi>=0.10 in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (0.16.0)
Requirement already satisfied, skipping upgrade: backcall in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (0.1.0)
Requirement already satisfied, skipping upgrade: setuptools>=18.5 in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (42.0.2)
Requirement already satisfied, skipping upgrade: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (3.0.3)
Requirement already satisfied, skipping upgrade: pexpect; sys_platform != "win32" in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (4.8.0)
Requirement already satisfied, skipping upgrade: pickleshare in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (0.7.5)
Requirement already satisfied, skipping upgrade: jinja2>=2.4 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (2.11.1)
Requirement already satisfied, skipping upgrade: nbformat>=4.4 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (5.0.4)
Requirement already satisfied, skipping upgrade: jupyter-core in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (4.6.3)
Requirement already satisfied, skipping upgrade: entrypoints>=0.2.2 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.3)
Requirement already satisfied, skipping upgrade: bleach in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (3.1.1)
Requirement already satisfied, skipping upgrade: testpath in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.4.4)
Requirement already satisfied, skipping upgrade: pandocfilters>=1.4.1 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (1.4.2)
Requirement already satisfied, skipping upgrade: mistune<2,>=0.8.1 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.8.4)
Requirement already satisfied, skipping upgrade: defusedxml in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.6.0)
Requirement already satisfied, skipping upgrade: jupyter-client>=4.1 in /usr/local/lib/python3.6/dist-packages (from qtconsole->jupyter->sql_magic) (6.0.0)
Requirement already satisfied, skipping upgrade: tornado>=4.2 in /usr/local/lib/python3.6/dist-packages (from ipykernel->jupyter->sql_magic) (6.0.3)
Requirement already satisfied, skipping upgrade: widgetsnbextension~=3.5.0 in /usr/local/lib/python3.6/dist-packages (from ipywidgets->jupyter->sql_magic) (3.5.1)
Requirement already satisfied, skipping upgrade: prometheus-client in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (0.7.1)
Requirement already satisfied, skipping upgrade: pyzmq>=17 in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (19.0.0)
Requirement already satisfied, skipping upgrade: Send2Trash in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (1.5.0)
Requirement already satisfied, skipping upgrade: terminado>=0.8.1 in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (0.8.3)
Requirement already satisfied, skipping upgrade: parso>=0.5.2 in /usr/local/lib/python3.6/dist-packages (from jedi>=0.10->ipython->sql_magic) (0.6.1)
Requirement already satisfied, skipping upgrade: wcwidth in /usr/local/lib/python3.6/dist-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->sql_magic) (0.1.8)
Requirement already satisfied, skipping upgrade: ptyprocess>=0.5 in /usr/local/lib/python3.6/dist-packages (from pexpect; sys_platform != "win32"->ipython->sql_magic) (0.6.0)
Requirement already satisfied, skipping upgrade: MarkupSafe>=0.23 in /usr/local/lib/python3.6/dist-packages (from jinja2>=2.4->nbconvert->jupyter->sql_magic) (1.1.1)
Requirement already satisfied, skipping upgrade: jsonschema!=2.5.0,>=2.4 in /usr/local/lib/python3.6/dist-packages (from nbformat>=4.4->nbconvert->jupyter->sql_magic) (3.2.0)
Requirement already satisfied, skipping upgrade: webencodings in /usr/local/lib/python3.6/dist-packages (from bleach->nbconvert->jupyter->sql_magic) (0.5.1)
Requirement already satisfied, skipping upgrade: importlib-metadata; python_version < "3.8" in /usr/local/lib/python3.6/dist-packages (from jsonschema!=2.5.0,>=2.4->nbformat>=4.4->nbconvert->jupyter->sql_magic) (1.5.0)
Requirement already satisfied, skipping upgrade: attrs>=17.4.0 in /usr/local/lib/python3.6/dist-packages (from jsonschema!=2.5.0,>=2.4->nbformat>=4.4->nbconvert->jupyter->sql_magic) (19.3.0)
Requirement already satisfied, skipping upgrade: pyrsistent>=0.14.0 in /usr/local/lib/python3.6/dist-packages (from jsonschema!=2.5.0,>=2.4->nbformat>=4.4->nbconvert->jupyter->sql_magic) (0.15.7)
Requirement already satisfied, skipping upgrade: zipp>=0.5 in /usr/local/lib/python3.6/dist-packages (from importlib-metadata; python_version < "3.8"->jsonschema!=2.5.0,>=2.4->nbformat>=4.4->nbconvert->jupyter->sql_magic) (3.0.0)

Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.15
    Uninstalling SQLAlchemy-1.3.15:
      Successfully uninstalled SQLAlchemy-1.3.15
Successfully installed sqlalchemy-1.3.16

In [2]:
%reload_ext sql_magic

In [3]:
from sqlalchemy import create_engine

conn_string = 'mysql://{user}:{password}@{host}/?charset=utf8'.format(
    host='db.ipeirotis.org',
    user='student',
    password='dwdstudent2015',
    encoding='utf-8')
engine = create_engine(conn_string)

In [4]:
%config SQL.conn_name = 'engine'

## `WHERE`: Equality Conditions

### IMDb

In [5]:
%%read_sql
USE imdb

Query started at 07:30:18 PM UTC; Query executed in 0.01 m

#### Find the movie entry with id 64729.

In [6]:
%%read_sql
SELECT *
FROM movies
WHERE id = 64729

Query started at 07:30:18 PM UTC; Query executed in 0.00 m

      id          name  year  rank
0  64729  Citizen Kane  1941   8.7

#### Find the movie entry with movie title ‘Pulp Fiction’

In [7]:
%%read_sql
SELECT *
FROM movies
WHERE name = 'Pulp Fiction'

Query started at 07:30:18 PM UTC; Query executed in 0.00 m

       id          name  year  rank
0  267038  Pulp Fiction  1994   8.7

#### Find the id of the movie “Schindler's List”. (Attention to the quote)

In [8]:
%%read_sql
SELECT *
FROM movies
WHERE name = 'Schindler\'s List'

Query started at 07:30:18 PM UTC; Query executed in 0.00 m

       id              name  year  rank
0  290070  Schindler's List  1993   8.8

In [9]:
%%read_sql
SELECT *
FROM movies
WHERE name = "Schindler's List"

Query started at 07:30:18 PM UTC; Query executed in 0.00 m

       id              name  year  rank
0  290070  Schindler's List  1993   8.8

#### List all the roles for the movie with id 290070. Sort them alphabetically

In [10]:
%%read_sql
SELECT *
FROM roles
WHERE movie_id = 290070
ORDER BY role

Query started at 07:30:18 PM UTC; Query executed in 0.01 m

     actor_id  movie_id               role
0      589844    290070               None
1      505804    290070       Albert Hujar
2      150137    290070         Amon Goeth
3       14688    290070    Auschwitz guard
4       66350    290070    Auschwitz guard
..        ...       ...                ...
141    430016    290070      Waffen SS man
142    271245    290070  Waffen SS officer
143    383090    290070             Waiter
144    276576    290070    Wilek Chilowicz
145    344532    290070      Wilhelm Kunde

[146 rows x 3 columns]

## `WHERE`: Boolean Operators

### IMDb

In [11]:
%%read_sql
USE imdb

Query started at 07:30:19 PM UTC; Query executed in 0.00 m

#### Fetch all info for actresses (female gender) whose first name is Skyler

In [12]:
%%read_sql
SELECT *
FROM actors
WHERE gender = 'F' AND first_name = 'Skyler'

Query started at 07:30:19 PM UTC; Query executed in 0.00 m

       id first_name    last_name gender
0  556133     Skyler  Blankenship      F
1  570689     Skyler     Campbell      F
2  595403     Skyler          Day      F
3  773680     Skyler         Rose      F
4  776752     Skyler      Russell      F
5  789243     Skyler        Shaye      F

#### Fetch all info for the director Steven Spielberg

In [13]:
%%read_sql
SELECT *
FROM directors
WHERE first_name = 'Steven' AND last_name = 'Spielberg'

Query started at 07:30:19 PM UTC; Query executed in 0.00 m

      id first_name  last_name
0  75380     Steven  Spielberg

#### Fetch all info for the directors with last names Scorsese, Polanski, and Spielberg. Use the OR for your Boolean query.

In [14]:
%%read_sql
SELECT *
FROM directors
WHERE last_name = 'Scorsese' OR last_name = 'Polanski' Or last_name = 'Spielberg'

Query started at 07:30:19 PM UTC; Query executed in 0.00 m

      id first_name  last_name
0  63095      Roman   Polanski
1  71645     Martin   Scorsese
2  75380     Steven  Spielberg

#### Fetch all info for the directors Quentin Tarantino, Stanley Kubrick, and Orson Welles.

In [15]:
%%read_sql
SELECT *
FROM directors
WHERE (first_name = 'Quentin' AND last_name = 'Tarantino') OR 
      (first_name = 'Stanley' AND last_name = 'Kubrick') OR 
      (first_name = 'Orson' AND last_name = 'Welles')

Query started at 07:30:19 PM UTC; Query executed in 0.00 m

      id first_name  last_name
0  43095    Stanley    Kubrick
1  78273    Quentin  Tarantino
2  84880      Orson     Welles

## `WHERE`: Inequality Queries

### IMDb

In [16]:
%%read_sql
USE imdb

Query started at 07:30:19 PM UTC; Query executed in 0.00 m

#### Find all information about movies that were released before 1895 (excl)

In [17]:
%%read_sql
SELECT *
FROM movies
WHERE year<1895

Query started at 07:30:19 PM UTC; Query executed in 0.00 m

        id                        name  year  rank
0    13261      Amateur Gymnast, No. 2  1894   NaN
1    17623   Annabelle Butterfly Dance  1894   5.3
2    17627  Annabelle Serpentine Dance  1894   6.1
3    17628         Annabelle Sun Dance  1894   NaN
4    17770                Annie Oakley  1894   4.9
..     ...                         ...   ...   ...
76  363640      Whirlwind Gun Spinning  1894   NaN
77  364791                 Widder, The  1894   NaN
78  368839                   Wrestling  1892   2.0
79  368852          Wrestling Dog, The  1894   NaN
80  368854             Wrestling Match  1894   NaN

[81 rows x 4 columns]

#### Find all information about movies released between 1895 and 1898 (excl) 

Try both using Boolean operators and using the BETWEEN operator

In [18]:
%%read_sql
SELECT *
FROM movies
WHERE year>1895 AND year<1898

Query started at 07:30:20 PM UTC; Query executed in 0.00 m

          id                                               name  year  rank
0         56                                  'Amphitrite', The  1897   NaN
1         70                                      'Brennus', Le  1897   NaN
2        247                     'Standard' Picture Animated, A  1897   NaN
3       1076  13th Infantry, U.S. Army Marching Through Sall...  1897   NaN
4       1077  13th Infantry, U.S. Army, in Heavy Marching Or...  1897   NaN
...      ...                                                ...   ...   ...
1093  372727                                  Young Rivals, The  1897   NaN
1094  375815                              Zoo van Antwerpen, De  1897   NaN
1095  376589             Z Pereira na Romaria de Santo Tirso, O  1896   NaN
1096  377666                               cole des gendres, L'  1897   NaN
1097  377845                                  pisodes de guerre  1897   NaN

[1098 rows x 4 columns]

In [19]:
%%read_sql
SELECT *
FROM movies
WHERE year BETWEEN 1896 AND 1897 -- notice that BETWEEN is inclusive on both sides

Query started at 07:30:20 PM UTC; Query executed in 0.00 m

          id                                               name  year  rank
0         56                                  'Amphitrite', The  1897   NaN
1         70                                      'Brennus', Le  1897   NaN
2        247                     'Standard' Picture Animated, A  1897   NaN
3       1076  13th Infantry, U.S. Army Marching Through Sall...  1897   NaN
4       1077  13th Infantry, U.S. Army, in Heavy Marching Or...  1897   NaN
...      ...                                                ...   ...   ...
1093  372727                                  Young Rivals, The  1897   NaN
1094  375815                              Zoo van Antwerpen, De  1897   NaN
1095  376589             Z Pereira na Romaria de Santo Tirso, O  1896   NaN
1096  377666                               cole des gendres, L'  1897   NaN
1097  377845                                  pisodes de guerre  1897   NaN

[1098 rows x 4 columns]

#### Find all information about movies that were released before 1895 and after 2006 (inclusive)

In [20]:
%%read_sql
SELECT *
FROM movies
WHERE year<=1895 OR year>=2006

Query started at 07:30:20 PM UTC; Query executed in 0.00 m

         id                                      name  year  rank
0       899                               10th & Wolf  2006   NaN
1      1799                                      2176  2006   NaN
2      2238                                       300  2006   NaN
3      9086                                   Airborn  2006   NaN
4      9495                   Akrobatisches Potpourri  1895   5.2
..      ...                                       ...   ...   ...
351  369459                                   X-Men 3  2006   NaN
352  372568  Young Griffo v. Battling Charles Barnett  1895   NaN
353  374889                                   Zhmurki  2006   NaN
354  400649                        "Pacific War, The"  2006   NaN
355  409052     "Turin 2006: XX Olympic Winter Games"  2006   NaN

[356 rows x 4 columns]

## The `IN` operator

### IMDb

In [21]:
%%read_sql
USE imdb

Query started at 07:30:20 PM UTC; Query executed in 0.00 m

#### Fetch all info for the directors with last names Scorsese, Polanski, and Spielberg. Use `IN` for your Boolean query.

In [22]:
%%read_sql
SELECT * 
FROM directors
WHERE last_name IN ( 'Scorsese', 'Spielberg', 'Polanski' );

Query started at 07:30:20 PM UTC; Query executed in 0.00 m

      id first_name  last_name
0  63095      Roman   Polanski
1  71645     Martin   Scorsese
2  75380     Steven  Spielberg

#### Fetch all info for the directors Quentin Tarantino, Stanley Kubrick, and Orson Welles. Use `IN` for your Boolean query.

In [23]:
%%read_sql
SELECT * FROM directors
WHERE (first_name, last_name) IN (
            ('Quentin', 'Tarantino'), 
            ('Stanley', 'Kubrick'), 
            ('Orson', 'Welles') 
)

Query started at 07:30:20 PM UTC; Query executed in 0.00 m

      id first_name  last_name
0  43095    Stanley    Kubrick
1  78273    Quentin  Tarantino
2  84880      Orson     Welles

## The `LIKE` operator for approximate queries

### IMDb

In [24]:
%%read_sql
USE imdb

Query started at 07:30:21 PM UTC; Query executed in 0.00 m

#### Find the entry for Alfred Hitchcock

Hint: Use an approximation for his first name

In [25]:
%%read_sql
SELECT *
FROM directors
WHERE last_name = 'Hitchcock' AND first_name LIKE 'A%%' -- The double %% is only necessary when writing SQL 
                                                        -- within Jupyter notebooks.

Query started at 07:30:21 PM UTC; Query executed in 0.00 m

      id  first_name  last_name
0  34658  Alfred (I)  Hitchcock

#### Find the Godfather movies, released in 1972, 1974, and 1990

In [26]:
%%read_sql
SELECT *
FROM movies
WHERE name LIKE 'Godfather%%'  AND -- The double %% is only necessary when writing SQL 
      year IN (1972, 1974, 1990)   -- within Jupyter notebooks.

Query started at 07:30:21 PM UTC; Query executed in 0.00 m

       id                      name  year  rank
0  130128            Godfather, The  1972   9.0
1  130129   Godfather: Part II, The  1974   8.9
2  130130  Godfather: Part III, The  1990   7.3